// Завдання до програми 1_2.
// Розробіть програму, що обчислює задані вирази. Результати поясніть за допомогою коментарів.

/*
* 1.	a1=3; a2=8; a2-=a1; b1=a1+2*a22; b2=!a1; b3=b2++; f1=1.5; f2=1.5; r1=f12+2*f2; r2=(f1!=f2)?f1-0.3:f2+0.4;
* 2.	a1=2; a2=3; a2*=10; b1=a13+a2; b2=a1>a2; b3=++b2; f1=1.5; f2=1.5; r1=2*f1-f2; r2=(f1==f2)?f1*3:f2*5;
* 3.	a1=6; a2=20; a2/=5; b1=5*a1+a22; b2=a1>a2; b3=--b2; f1=1.5; f2=3.5; r1=f1+4*f2; r2=(f1>=f2)?f1-2.5:f2+5.2;
* 4.	a1=3; a2=2; a2+=a1+5; b1=a13+3*a2; b2=a1<a2; b3=b2--; f1=1.5; f2=2.5; r1=f1/f2*2; r2=(f1<=f2)?f1-0.2:f2+0.7;
* 5.	a1=5; a2=13; a2-=a1+5; b1=a1+a22; b2=a1>a2; b3=b2++; f1=4.5; f2=1.8; r1=f1+f2/2; r2=(f1>f2)?f1+1.2:f2-1.4;
*/

#include <stdio.h>
#include <stdlib.h>

void example(void)
{
	int a1 = 9, a2 = 2, b1, b2 = 0, b3;
	a2 += a1; // a2=2+9=11
	b1 = a2 / 4 + a2 % 4; // b1=11/4+11%4=2+3=7
	b2 = b1 > b2 && b1 > a2; // b3=(7>3) та(7>11) ? нi 0
	printf("b2=%d\n", b2);
	b3 = --b2; // b2=b2-1=0-1=-1 b3=b2=-1
	printf("a2=%d b1=%d b2=%d b3=%d\n", a2, b1, b2, b3);
	float f1 = 3.6, f2 = 0.5, r1, r2;
	r1 = f1 / f2; // r1=3.6/0.5=7.2
	r2 = (f1 < f2) ? f1 + 2 : --f2; // r2=(3.6<0.5)? нi (0.5–1)= –0.5
	printf("r1=%5.2f r2=%5.2f\n", r1, r2);
}

void task_1(void)
{
	int a1 = 3, a2 = 8, b1, b2, b3;
	a2 -= a1; // a2=8-3=5
	b1 = a1 + 2 * a2; // b1=3+2*5=13
	b2 = !a1; // b2=0
	b3 = b2++; // b3=b2=0 b2=b2+1=1
	float f1 = 1.5, f2 = 1.5, r1, r2;
	r1 = f1 + 2 * f2; // r1=1.5+2*1.5=4.5
	r2 = (f1 != f2) ? f1 - 0.3 : f2 + 0.4; // r2=(1.5!=1.5)? нi 1.5+0.4=1.9
	printf("a1=%d a2=%d b1=%d b2=%d b3=%d f1=%5.2f f2=%5.2f r1=%5.2f r2=%5.2f\n", a1, a2, b1, b2, b3, f1, f2, r1, r2);
}

void task_2(void)
{
	int a1 = 2, a2 = 3, b1, b2, b3;
	a2 *= 10; // a2=3*10=30
	b1 = a1 + a2; // b1=2+30=32
	b2 = a1 > a2; // b2=0
	b3 = ++b2; // b2=b2+1=1 b3=b2=1
	float f1 = 1.5, f2 = 1.5, r1, r2;
	r1 = 2 * f1 - f2; // r1=2*1.5-1.5=2.5
	r2 = (f1 == f2) ? f1 * 3 : f2 * 5; // r2=(1.5==1.5)? так 1.5*3=4.5
	printf("a1=%d a2=%d b1=%d b2=%d b3=%d f1=%5.2f f2=%5.2f r1=%5.2f r2=%5.2f\n", a1, a2, b1, b2, b3, f1, f2, r1, r2);
}

void task_3(void)
{
	int a1 = 6, a2 = 20, b1, b2, b3;
	a2 /= 5; // a2=20/5=4
	b1 = 5 * a1 + a2; // b1=5*6+4=34
	b2 = a1 > a2; // b2=1
	b3 = --b2; // b2=b2-1=1-1=0 b3=b2=0
	float f1 = 1.5, f2 = 3.5, r1, r2;
	r1 = f1 + 4 * f2; // r1=1.5+4*3.5=15.5
	r2 = (f1 >= f2) ? f1 - 2.5 : f2 + 5.2; // r2=(1.5>=3.5)? нi 3.5+5.2=8.7
	printf("a1=%d a2=%d b1=%d b2=%d b3=%d f1=%5.2f f2=%5.2f r1=%5.2f r2=%5.2f\n", a1, a2, b1, b2, b3, f1, f2, r1, r2);
}

void task_4(void)
{
	int a1 = 3, a2 = 2, b1, b2, b3;
	a2 += a1 + 5; // a2=2+3+5=10
	b1 = a1 + 3 * a2; // b1=3+3*10=33
	b2 = a1 < a2; // b2=1
	b3 = b2--; // b3=b2=1 b2=b2-1=0
	float f1 = 1.5, f2 = 2.5, r1, r2;
	r1 = f1 / f2 * 2; // r1=1.5/2.5*2=1.2
	r2 = (f1 <= f2) ? f1 - 0.2 : f2 + 0.7; // r2=(1.5<=2.5)? так 1.5-0.2=1.3
	printf("a1=%d a2=%d b1=%d b2=%d b3=%d f1=%5.2f f2=%5.2f r1=%5.2f r2=%5.2f\n", a1, a2, b1, b2, b3, f1, f2, r1, r2);
}

void task_5(void)
{
	int a1 = 5, a2 = 13, b1, b2, b3;
	a2 -= a1 + 5; // a2=13-5-5=3
	b1 = a1 + a2; // b1=5+3=8
	b2 = a1 > a2; // b2=1
	b3 = b2++; // b3=b2=1 b2=b2+1=2
	float f1 = 4.5, f2 = 1.8, r1, r2;
	r1 = f1 + f2 / 2; // r1=4.5+1.8/2=5.4
	r2 = (f1 > f2) ? f1 + 1.2 : f2 - 1.4; // r2=(4.5>1.8)? так 4.5+1.2=5.7
	printf("a1=%d a2=%d b1=%d b2=%d b3=%d f1=%5.2f f2=%5.2f r1=%5.2f r2=%5.2f\n", a1, a2, b1, b2, b3, f1, f2, r1, r2);
}

int main(int argc, char* argv[])
{
	example();
	task_1();
	task_2();
	task_3();
	task_4();
	task_5();
	system("pause");
	return 0;
}
